; ============================================================================= 
; CONSTANTS SECTION
; ============================================================================= 


BUFFER_SIZE         equ 128             ; Ограничение на размер буфера
; Файловый дескриптор стандартного потока вывода
STDOUT_FD           equ 1  
NUMBER_OF_BITS      equ 32              ; Количество бит в целом числе (int)
NUMBER_OF_XMM_REGS  equ 8               ; Количество xmm регистров


; Переменная, хранящаа значение счетчика использованных xmm регистров
; в функции my_printf_logic
%define  xmm_counter [rbp - 48] 


; ============================================================================= 
; RODATA SECTION
; ============================================================================= 
section .rodata


; Таблица прыжков для обработки спефицикаторов в функции my_printf_logic
jump_table:
                    dq my_printf_logic.case_b
                    dq my_printf_logic.case_c
                    dq my_printf_logic.case_d
                    times ('f' - 'd' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_f
                    times ('o' - 'f' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_o
                    times ('s' - 'o' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_s
                    times ('x' - 's' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_x           

; Символы для перевода числовых значений в строковый формат
digits              db "0123456789ABCDEF"

inf_string          db "inf"
inf_string_len      equ $ - inf_string

nan_string          db "NaN"
nan_string_len      equ $ - nan_string


; ============================================================================= 
; BSS SECTION
; ============================================================================= 
section .bss


; Место для хранения данных (для реализации буферизированного вывода)
buffer              resb BUFFER_SIZE
; Место для хранения строкового представления числа
ascii_buffer        resb BUFFER_SIZE


; ============================================================================= 
; TEXT SECTION
; ============================================================================= 
section .text
    global my_printf


; ============================================================================= 
; Procedure: my_printf
; ============================================================================= 
; Описание:
;       Осуществляет форматный вывод строки в стандартный поток вывода
; Входные параметры:
;       rdi           - Форматная строка
;       rsi           - 1 аргумент
;       rdx           - 2 аргумент
;       rcx           - 3 аргумент
;       r8            - 4 аргумент
;       r9            - 5 аргумент 
;       xmm0-xmm7     - Аргументы, являющиеся числами с плавающей точкой
;       [rsp + 8 * i] - (i + 6) аргумент
; Выходные параметры:
;       Нет
; Портящиеся регистры:
;       Все регистры
; ============================================================================= 
my_printf:
    pop r15                             ; Сохранение адреса возврата

; Реализация изменения типа вызова функции
    push    r9                         
    push    r8                         
    push    rcx                        
    push    rdx                        
    push    rsi                        
    push    rdi                        
           
 ; Кладем в стек значения XMM регистров
    sub     rsp, 64
    movq    [rsp + 56], xmm7
    movq    [rsp + 48], xmm6
    movq    [rsp + 40], xmm5
    movq    [rsp + 32], xmm4
    movq    [rsp + 24], xmm3
    movq    [rsp + 16], xmm2
    movq    [rsp + 8],  xmm1
    movq    [rsp],      xmm0

    call    my_printf_logic
    add     rsp, 8 * 6 + 8 * 8

    push    r15                         ; Восстановление адрес возврата
    ret
; ============================================================================= 


; ============================================================================= 
; Procedure: my_printf_logic
; =============================================================================
; Описание:
;       Логика форматного вывода строки
; Входные параметры:
;       [rbp + 16]-[rbp + 72] - Аргументы, явл. числами с плавающей точкой 
;       [rbp + 80]            - Форматная строка
;       [rbp + 80 + 8 * i]    - Данные для i-го целочисленного аргумента
; Выходные параметры:
;       Нет
; Портящиеся регистры:
;       callee-saved регистры
; =============================================================================
my_printf_logic:
; --- Start Prologue ---
    push    rbp                                                                  
    mov     rbp, rsp

    push    rbx
    push    r12
    push    r13
    push    r14
    push    r15
; --- End Prologue --- 

; Выделяем место под переменную xmm_counter и инициализируем её
    sub     rsp, 8
    mov qword xmm_counter, 0
; В регистре rbx хранится адрес текущего аргумента
    mov     rbx, rbp        
    add     rbx, 80
; В регистре r12 хранится адрес форматной строки
    mov     r12, [rbx]             
    add     rbx, 8
; В регистре r13 хранится адрес буфера
    mov     r13, buffer          
; В регистре r14 хранится смещение в форматной строке
    xor     r14d, r14d                  
; В регистре r15 хранится размер содержимого буфера
    xor     r15d, r15d

.main_loop:
    movzx   rax, byte [r12 + r14]
    test    rax, rax
    je     .done

    cmp     byte [r12 + r14], '%'
    je      .spec_handler

    movzx   rax, byte [r12 + r14]
    mov     byte [r13 + r15], al
    inc     r14
    inc     r15

.check_buffer:
    cmp     r15, BUFFER_SIZE
    jb      .main_loop

    mov     rdi, r13
    mov     rsi, r15
    call    print_buffer
    xor     r15d, r15d

    jmp     .main_loop

.done:

; Необходимо очистить буфер от оставшихся символов
    call    .flush_buffer

; Очищаем место, занятое локальными переменными
    add     rsp, 8
; --- Start Epilogue --- 
    pop     r15
    pop     r14
    pop     r13
    pop     r12
    pop     rbx

    pop     rbp
; --- End Epilogue --- 
    ret


; .............................................................................
; Logic Block .spec_handler
; .............................................................................
; Описание:
;       Копирует символ в основной буфер
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       Адрес из таблицы прыжков
; .............................................................................
.spec_handler:
; Обработка спецификатора в форматной строке
    inc     r14                      
    movzx   rax, byte [r12 + r14]
    lea     rsi, [jump_table]
    jmp     [rsi + (rax - 'b') * 8]
; .............................................................................


; .............................................................................
; Logic Block .number_handler
; .............................................................................
; Описание:
;       Подготавливает число к выводу через itoa и копирует в основной буфер
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
;       rbx     - Адрес аргумента в стеке
;       rsi     - Основание системы счисления
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       jmp .check_buffer
; .............................................................................
.number_handler:
    inc     r14
    mov     rdi, [rbx]              
    add     rbx, 8
    mov     rdx, ascii_buffer
    xor     ecx, ecx
    call    itoa

    mov     rdx, rax
    add     rdx, r15
    cmp     rdx, BUFFER_SIZE
    jb      .skip_flush

    call    .flush_buffer

.skip_flush:
    mov     rsi, ascii_buffer
    mov     rcx, rax

    call    .copy_to_buffer
    jmp     .check_buffer
; .............................................................................


; .............................................................................
; Logic Block .string_handler
; .............................................................................
; Описание:
;       Размещает строку в буфере, а при недостатке места печатает ее сразу
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
;       rbx     - Адрес аргумента в стеке
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       jmp .check_buffer
; .............................................................................
.string_handler:
; Получение адреса строки
    inc     r14
    mov     rdi, [rbx]
    add     rbx, 8

    call    string_len                  ; Нахождение длины строки

; Если строка состоит только из ноль-терминатора, то ее печать пропускается
    mov     rcx, rax
    test    rcx, rcx
    je      .main_loop
; Если длина строки больше размера буфера, то она выводится
; в стандартный поток вывода напрямую
    cmp     rcx, BUFFER_SIZE
    jae     .print_direct
; Если в буфере недостаточно места для размещения строки, то он очищается
    add     rcx, r15
    cmp     rcx, BUFFER_SIZE
    jb      .move_to_buffer

    call    .flush_buffer

.move_to_buffer:
    mov     rsi, rdi
    mov     rcx, rax
    call    .copy_to_buffer
    jmp     .check_buffer

.print_direct:
    mov     rsi, rcx
; В регистре rdi находится адрес строки, в rsi - ее длина
    call    print_buffer
    jmp     .check_buffer
; .............................................................................


; .............................................................................
; Logic Block .float_handler
; .............................................................................
; Описание:
;       Подгатавливает число с плавающей точкой к выводу и копирует в буфер
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
;       rbx     - Адрес аргумента в стеке
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       jmp .check_buffer
; .............................................................................
.float_handler:
    inc     r14
    mov     rax, qword xmm_counter
    cmp     rax, 8
    jae     .alternative_take

    mov     rdi, [rbp + 16 + 8 * rax]
    inc     qword xmm_counter
    jmp     .float_processing

.alternative_take:
    mov     rdi, [rbx]
    add     rbx, 8
    jmp     .float_processing

.float_processing:
; В регистре rdi находится число с плавающей точкой
    mov     rsi, ascii_buffer
    mov     rdx, 0
    call    ftoa

    mov     rsi, ascii_buffer
    mov     rcx, rax
    call    .copy_to_buffer

    jmp     .check_buffer    
; .............................................................................


; -----------------------------------------------------------------------------
; Local Procedure: .copy_to_buffer
; -----------------------------------------------------------------------------
; Описание:
;       Копирует данные в буфер
; Входные параметры:
;       rsi - Адрес источника
;       rcx - Сколько байт копировать
; Используемые данные:
;       r13 - Адрес буфера
;       r15 - Текущее смещение
; Портящиеся регистры:
;       caller-saved регистры
;       r15 - Изменение размера буфера
; -----------------------------------------------------------------------------
.copy_to_buffer:
    test    rcx, rcx    
    je      .copy_done

.copy_loop:
    cmp     r15, BUFFER_SIZE
    jb      .do_copy

    push    rcx
    call    .flush_buffer
    pop     rcx

.do_copy:
    movzx   rdx, byte [rsi]
    mov     byte [r13 + r15], dl
    inc     rsi
    inc     r15
    loop    .copy_loop

.copy_done:
    ret
; -----------------------------------------------------------------------------


; -----------------------------------------------------------------------------
; Local Procedure: .flush_buffer
; -----------------------------------------------------------------------------
; Описание:
;       Выводит содержимое буфера в стандартный поток вывода
; Входные параметры:
;       Нет
; Используемые данные:
;       r13 - Адрес буфера
;       r15 - Текущее смещение
; Портящиеся регистры:
;       caller-saved региcтры
;       r15 - Обнуление размера буфера
; -----------------------------------------------------------------------------
.flush_buffer:
    push    rdi
    push    rsi

    mov     rdi, r13
    mov     rsi, r15
    call    print_buffer
    xor     r15d, r15d

    pop     rsi
    pop     rdi

    ret
; -----------------------------------------------------------------------------


.case_b:
    mov     rsi, 2
    jmp     .number_handler

.case_c:
    movzx   rax, byte [rbx]             ; Получаем символ
    add     rbx, 8

    mov     byte [r13 + r15], al        ; Кладем в буфер символ
    inc     r14
    inc     r15

    jmp     .check_buffer

.case_d:
    mov     rsi, 10
    jmp     .number_handler

.case_f:
    jmp     .float_handler

.case_o:
    mov     rsi, 8
    jmp     .number_handler

.case_s:
    jmp     .string_handler

.case_x:
    mov     rsi, 16                 
    jmp     .number_handler

.case_default:
    nop
; =============================================================================


; =============================================================================
; Procedure: print_buffer
; =============================================================================
; Описание:
;       Выводит содержимое буфера в стандартный поток вывода
; Входные параметры:
;       rdi - Указатель на буфер
;       rsi - Количество элементов в буфере
; Выходные параметры:
;       Нет
; Портящиеся регистры:
;       callee-caller
; =============================================================================
print_buffer:
    mov     rax, 1
    mov     rdx, rsi
    mov     rsi, rdi
    mov     rdi, STDOUT_FD
    syscall

    ret
; =============================================================================


; =============================================================================
; Procedure: string_len
; =============================================================================
; Описание:
;       Находит длину строки, оканчивающейся ноль-терминатором
; Входные параметры:
;       rdi - Указатель на строку
; Выходные параметры:
;       rax - Длина строки
; Портящиеся регистры:
;       caller-saved регистры
; =============================================================================
string_len:
    xor     ecx, ecx
.counting_loop:
    movzx   rax, byte [rdi + rcx]
    test    rax, rax
    je      .exit

    inc     rcx
    jmp     .counting_loop

.exit:
    mov     rax, rcx
    ret
; =============================================================================


; =============================================================================
; Procedure: itoa
; =============================================================================
; Описание:
;       Осуществляет запись числа в буфер в необходимой системе счисления
; Входные параметры:
;       rdi - Число
;       rsi - Основание системы счисления (2, 8, 10, 16)
;       rdx - Указатель на буфер
;       rcx - Количество элементов в буфере
; Выходные параметры:
;       rax - Итоговое количество элементов в буфере
; Портящиеся регистры:
;       caller-saved регистры
; =============================================================================
itoa:
; 10-я СС обрабатывается отдельно
    cmp     rsi, 10
    je      .decimal_logic              

    call    itoa_power2
    jmp     .exit

.decimal_logic:
    call    itoa_decimal
    jmp     .exit

.exit:
; В регистре rax уже лежит итоговое количество элементов в буфере
    ret 
; =============================================================================


; =============================================================================
; Procedure: itoa_power2
; =============================================================================
; Описание:
;       Осуществляет запись числа в буфер в системе счисления со степенью двойки
; Входные параметры:
;       rdi - Число
;       rsi - Основание системы счисления (2, 8, 16)
;       rdx - Указатель на буфер
;       rcx - Количество элементов в буфере
; Выходные параметры:
;       rax - Итоговое количество элементов в буфере
; Портящиеся регистры:
;       callee-caller
; =============================================================================
itoa_power2:
; --- Start Prologue ---
    push    rbp
    mov     rbp, rsp

    push    rbx
    push    r12
    push    r13
    push    r14
    push    r15
; --- End Prologue ---

; В регистре r13 хранится указатель на буфер
    mov     r13, rdx   
; В регистре r14 хранится количество элементов в буфере
    mov     r14, rcx
; В регистре r15 хранится число 
    mov     r15, rdi
; В регистре r8 хранится шаг для битового сдвига. Инструкция 
; bsr найдет индекс наибольшего единичного бита в rsi
    bsr     r8, rsi
    xor     edx, edx
    mov     rax, NUMBER_OF_BITS
; В регистре rax хранится количество разрядов числа в заданной 
; системе счисления. Делимое лежит в rdx:rax, делитель в r8.
; rax = 64 / r8
; rdx = 64 % r8
    div     r8

    test    rdx, rdx
    je      .skip_inc
; Если после нахождение шага битового сдвига число 64 поделилось не нацело,
; то в таком случае надо учесть неполный разряд, который остался.
    inc     rax

.skip_inc:
    mov     rbx, rax

    mov     r9, rsi
; r9 = base - 1 - битовая маска
    dec     r9                          

    mov     rcx, r8
    mov     rax, rbx
.loop_1:
    mov     rsi, r15
    and     rsi, r9
    push    rsi
    shr     r15, cl

    dec     rax
    jne     .loop_1

    mov     rcx, rbx
    xor     r12d, r12d
.loop_2:
    pop     rsi

    test    rsi, rsi
    jne     .is_significant

    test    r12, r12
    je      .condition_2

.is_significant:
    movzx   rsi, byte [digits + rsi]
    mov     byte [r13 + r14], sil
    inc     r14
; Если значение r12 не нулевое, значит встречались значащие цифры
    inc     r12

.condition_2:
    loop    .loop_2

    test    r14, r14
    jne     .exit

    mov     byte [r13 + r14], '0'
    mov     r14, 1

.exit:
    mov     rax, r14
; --- Start Epilogue ---
    pop     r15
    pop     r14
    pop     r13
    pop     r12
    pop     rbx

    pop     rbp
; --- End Epilogue ---
    ret 
; =============================================================================


; =============================================================================
; Procedure: itoa_decimal
; =============================================================================
; Описание:
;       Осуществляет запись числа в буфер в десятичной системе счисления
; Входные параметры:
;       rdi - Число
;       rsi - Основание системы счисления (10)
;       rdx - Указатель на буфер
;       rcx - Количество элементов в буфере
; Выходные параметры:
;       rax - Итоговое количество элементов в буфере
; Портящиеся регистры:
;       caller-saved регистры
; =============================================================================
itoa_decimal:
; --- Start Prologue ---
    push    rbp
    mov     rbp, rsp

    push    r13
    push    r14
; --- End Prologue ---

; В регистре r13 хранится указатель на буфер
    mov     r13, rdx   
; В регистре r14 хранится количество элементов в буфере
    mov     r14, rcx

    mov     eax, edi
    test    eax, eax
    jge     .skip_sign_case

    mov     byte [r13 + r14], '-'
    inc     r14
    neg     eax

.skip_sign_case:
    xor     ecx, ecx
    mov     esi, 10
.loop_1:
    xor     edx, edx
    div     rsi

    push    rdx
    inc     rcx

    test    eax, eax
    jne     .loop_1

.loop_2:
    pop     rax
    movzx   rdx, byte [digits + rax]
    mov     byte [r13 + r14], dl
    inc     r14
    loop    .loop_2

    mov     rax, r14
; --- Start Epilogue ---
    pop     r14
    pop     r13

    pop     rbp
; --- End Epilogue ---
    ret 
; =============================================================================


; =============================================================================
; Procedure: ftoa
; =============================================================================
; Описание:
;       Осуществляет запись числа с плавающей точкой в буфер
; Входные параметры:
;       rdi - Число с плавающей точкой
;       rsi - Указатель на буфер
;       rdx - Количество элементов в буфере
; Выходные параметры:
;       rax - Итоговое количество элементов в буфере
; Портящиеся регистры:
;       caller-saved регистры
; =============================================================================
ftoa:
; --- Start Prologue ---
    push    rbp
    mov     rbp, rsp

    push    rbx
    push    r13
    push    r14
    push    r15
; --- End Prologue --- 

; В регистре rbx хранится точность вывода числа
; Под точностью подразумевается количество выводимых цифр после запятой
    mov     rbx, 6
; В регистре r13 хранится указатель на буфер
    mov     r13, rsi
; В регистре r14 хранится количество элементов в буфере
    mov     r14, rdx
; В регистре r15 хранится число
    mov     r15, rdi

    mov     rcx, 0x8000000000000000
    and     rdi, rcx
    test    rdi, rdi
    je      .skip_sign_printing

    mov     byte [r13 + r14], '-'
    inc     r14

.skip_sign_printing:
; Извлекаем экспоненту
    mov     rdi, r15
    mov     rcx, 0x7FF0000000000000
    and     rdi, rcx
    shr     rdi, 52

; Проверяем исключения (inf/NaN)
    cmp     rdi, 0x7FF
    je      .handle_exceptions

; Сдвигаем степень двойки
    sub     rdi, 1023

; Извлекаем мантиссу
    mov     rsi, r15
    mov     rcx, 0x000FFFFFFFFFFFFF
    and     rsi, rcx
; Добавляем ведущую единицу к мантиссе
    mov     rcx, 0x0010000000000000
    or      rsi, rcx

    cmp     rdi, -1023
    jne     .skip_denormalized_case
; Добавляем единицу для денормализованного числа
    inc     rdi
    mov     rcx, 0x0010000000000000
; Обнуляем ведущую единицу у денормализованного числа
    xor     rsi, rcx

.skip_denormalized_case:
; Выравниваем мантиссу по левому краю 
    shl     rsi, 11

; Храним в регистре rdx сдвиг 
    mov     rdx, 63
    sub     rdx, rdi

; Если экспонента слишком большая, то обрабатываем число в научной записи
    cmp     rdi, 60
    ; jg      .scientific_handler
; Если экспонента слишком маленькая, то обрабатываем число в научной записи
    cmp     rdi, -4
    ; jl      .scientific_handler
; Если экспонента меньше нуля, то число < 1, а значит нет необходимости
; обрабатывать его целую часть
    cmp     rdi, 0 
    jl      .small_number

; Сохраняем экспоненту и мантиссу
    push    rdi
    push    rsi

; В регистре rcx будет находиться сдвиг (63 - exp)
; Так как 0 <= exp < 60, то (63 - exp) > 0
    mov     rcx, 63
    sub     rcx, rdi
    mov     rdi, rsi
; В регистре rdi будет находиться целая часть числа
    shr     rdi, cl
    mov     rsi, 10
    mov     rdx, r13
    mov     rcx, r14
; Кладем в буфер целую часть числа
    call    itoa
    mov     r14, rax

; Возвращаем мантиссу и экспоненту
    pop     rsi
    pop     rdi

; Ставим точку в числе
    mov     byte [r13 + r14], '.'
    inc     r14

; В регистре rcx будет находиться сдвиг (exp + 1)
    mov     rcx, rdi
    inc     rcx
; В регистре rsi будет находиться дробная часть числа
    shl     rsi, cl
    jmp     .fraction_loop

.small_number:
; Если -5 < exp < 0, то дробная часть = rsi >> (-exp), но а целая часть уже = 0,
; поэтому ставим ноль и точку в числе
    mov     byte [r13 + r14], '0'
    inc     r14
    mov     byte [r13 + r14], '.'
    inc     r14

    neg     rdx
    mov     rcx, rdx
; В регистре rsi будет хранится дробная часть числа
    shr     rsi, cl
    jmp     .fraction_loop

.fraction_loop:
    xor     edx, edx
    mov     rax, rsi
    mov     rcx, 10
    mul     rcx

    movzx   rcx, byte [digits + rdx]
    mov     byte [r13 + r14], cl
    inc     r14

    mov     rsi, rax
    dec     rbx
    jne     .fraction_loop

.done:

    mov     rax, r14
; --- Start Epilogue ---
    pop    r15
    pop    r14
    pop    r13
    pop    rbx

    pop     rbp
; --- End Epilogue ---
    ret

.handle_exceptions:
    mov     rdi, r15
    mov     rcx, 0x000FFFFFFFFFFFFF
    and     rdi, rcx
    test    rdi, rdi
    je      .handle_inf
    jmp     .handle_nan

.handle_inf:
    mov     rsi, inf_string 
    mov     rcx, inf_string_len
    call    .copy_to_buffer
    jmp     .done

.handle_nan:
    mov     rsi, nan_string
    mov     rcx, nan_string_len
    call    .copy_to_buffer
    jmp     .done


; -----------------------------------------------------------------------------
; Local Procedure: .copy_to_buffer
; -----------------------------------------------------------------------------
; Описание:
;       Копирует данные в буфер
; Входные параметры:
;       rsi - Адрес источника
;       rcx - Сколько байт копировать
; Используемые данные:
;       r13 - Адрес буфера
;       r14 - Текущее смещение
; Портящиеся регистры:
;       caller-saved регистры
; -----------------------------------------------------------------------------
.copy_to_buffer:
    test    rcx, rcx    
    je      .copy_done

.do_copy:
    movzx   rdx, byte [rsi]
    mov     byte [r13 + r14], dl
    inc     rsi
    inc     r14
    loop    .do_copy

.copy_done:
    ret
; -----------------------------------------------------------------------------


; =============================================================================


; =============================================================================
; node.GNU-stack SECTION
; =============================================================================
section .note.GNU-stack