; ============================================================================= 
; CONSTANTS SECTION
; ============================================================================= 


; Ограничение на размер буфера
BUFFER_SIZE         equ 256
; Файловый дескриптор стандартного потока вывода
STDOUT_FD           equ 1  
; Количество бит в целом числе (int)
NUMBER_OF_BITS      equ 32              
; Количество байт, выделенных под регистры xmm в стеке
XMM_STORAGE_SIZE    equ 64

; Смещение регистра rdi относительно rbp в функции my_printf_logic
RDI_OFFSET          equ 80
; Смещение регистра rsi относительно rbp в функции my_printf_logic
RSI_OFFSET          equ 88
; Смещение начала области стековых аргументов относительно rbp
; в функции my_printf_logic
STACK_ARG_START     equ 136
; Смещение начала области вещественных аргументов относительно rbp
; в функции my_printf_logic
XMM_ARG_START       equ 16

; Количество регистров общего назначения, используемых для передачи
; аргументов в функцию без учета форматной строки
GRP_REG_COUNT       equ 5
; Количество вещественных регистров, используемых для передачи
; аргументов в функции
XMM_REG_COUNT       equ 8

; Основание двоичной СС
BIN_BASE            equ 2
; Основание восьмеричной СС
OCT_BASE            equ 8
; Основание десятичной СС
DECIMAL_BASE        equ 10
; Основание шестнадцатиричной СС
HEX_BASE            equ 16

; Количество знаков после запятой у вещественного числа
DEFAULT_PRECISION   equ 6

; Битовая маска для бита знака у числа double
DOUBLE_SIGN_MASK    equ 0x8000000000000000
; Битовая маска показателя у числа double
DOUBLE_EXP_MASK     equ 0x7FF0000000000000
; Смещение показателя у числа double
DOUBLE_EXP_BIAS     equ 1023
; Смещение для нахождения целой части 
DOUBLE_EXP_SHIFT    equ 52

DOUBLE_MANT_MASK    equ 0x000FFFFFFFFFFFFF
DOUBLE_MANT_IMAGINARY_1_MASK equ 0x0010000000000000

; Переменная, хранящая счетчик пройденных аргументов из
; регистров rxx в функции my_printf_logic
%define xmm_counter [rbp - 48] 
; Переменная, хранящая счетчик пройденных аргументов из 
; регистров xmm в функции my_printf_logic
%define rxx_counter [rbp - 56]
; Минимальный по значению ascii-символ, используемый в таблице прыжков
%define MIN_ASCII_SYMBOL '%'


; ============================================================================= 
; DATA SECTION
; ============================================================================= 
section .data


; Таблица прыжков для обработки спефицикаторов в функции my_printf_logic
jump_table:
                    dq my_printf_logic.case_percent
                    times ('b' - '%' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_b
                    dq my_printf_logic.case_c
                    dq my_printf_logic.case_d
                    times ('f' - 'd' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_f
                    times ('o' - 'f' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_o
                    times ('s' - 'o' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_s
                    times ('x' - 's' - 1) dq my_printf_logic.case_default
                    dq my_printf_logic.case_x           


; ============================================================================= 
; RODATA SECTION
; ============================================================================= 
section .rodata


; Символы для перевода числовых значений в строковый формат
digits              db "0123456789ABCDEF"

inf_string          db "inf"
inf_string_len      equ $ - inf_string

nan_string          db "NaN"
nan_string_len      equ $ - nan_string


; ============================================================================= 
; BSS SECTION
; ============================================================================= 
section .bss


; Место для хранения данных (для реализации буферизированного вывода)
buffer              resb BUFFER_SIZE
; Место для хранения строкового представления числа
ascii_buffer        resb BUFFER_SIZE


; ============================================================================= 
; TEXT SECTION
; ============================================================================= 
section .text
    extern printf
    global my_printf


; ============================================================================= 
; Procedure: my_printf
; ============================================================================= 
; Описание:
;       Осуществляет форматный вывод строки в стандартный поток вывода
; Входные параметры:
;       rdi           - Форматная строка
;       rsi           - 1 аргумент
;       rdx           - 2 аргумент
;       rcx           - 3 аргумент
;       r8            - 4 аргумент
;       r9            - 5 аргумент 
;       xmm0-xmm7     - Аргументы, являющиеся числами с плавающей точкой
;       [rsp + 8 * i] - Область смешанных аргументов
; Выходные параметры:
;       Нет
; Портящиеся регистры:
;       caller-saved
; ============================================================================= 
my_printf:
; Сохранение адреса возврата
    pop     r11
; Сохранение количества используемых регистров xmm в al
    push    rax
; Сохраняем содержимое регистров типа вызова System V ABI
    push    r9                         
    push    r8                         
    push    rcx                        
    push    rdx                        
    push    rsi                        
    push    rdi                        
           
; Кладем в стек значения XMM регистров
    sub     rsp, XMM_STORAGE_SIZE
    movq    [rsp + 56], xmm7
    movq    [rsp + 48], xmm6
    movq    [rsp + 40], xmm5
    movq    [rsp + 32], xmm4
    movq    [rsp + 24], xmm3
    movq    [rsp + 16], xmm2
    movq    [rsp + 8],  xmm1
    movq    [rsp],      xmm0

    call    my_printf_logic
    add     rsp, XMM_STORAGE_SIZE

; Возвращаем содержимое регистров 
    pop     rdi
    pop     rsi
    pop     rdx
    pop     rcx
    pop     r8
    pop     r9
; Восстанавливаем содержимое регистра rax
    pop     rax
; Восстановление адреса возврата
    push    r11 

    jmp     printf wrt ..plt
; ============================================================================= 


; ============================================================================= 
; Procedure: my_printf_logic
; =============================================================================
; Описание:
;       Логика форматного вывода строки
; Входные параметры:
;       [rbp + 16]-[rbp + 72]  - Аргументы, явл. числами с плавающей точкой 
;       [rbp + 80]             - Форматная строка
;       [rbp + 88]-[rbp + 120] - Целочисленные аргументы
;       [rbp + 128]            - Сохраненный rax
;       [rbp + 136]-...        - Перемешанные аргументы различных типов
; Выходные параметры:
;       Нет
; Портящиеся регистры:
;       callee-saved регистры, rax, r11
; =============================================================================
my_printf_logic:
; --- Start Prologue ---
    push    rbp                                                                  
    mov     rbp, rsp

    push    rbx
    push    r11
    push    r12
    push    r13
    push    r14
    push    r15
; --- End Prologue --- 

; Выделяем место под переменную xmm_counter и инициализируем ее
    sub     rsp, 8
    mov     qword xmm_counter, 0
; Выделяем место под переменную rxx_counter и инициализируем ее
    sub     rsp, 8
    mov     qword rxx_counter, 0
; В регистре rbx хранится адрес текущего аргумента (Изначально rbp + 136)
    mov     rbx, rbp        
    add     rbx, STACK_ARG_START
; В регистре r12 хранится адрес форматной строки
    mov     r12, [rbp + RDI_OFFSET]             
; В регистре r13 хранится адрес буфера
    lea     r13, [rel buffer]
; В регистре r14 хранится смещение в форматной строке
    xor     r14d, r14d                  
; В регистре r15 хранится размер содержимого буфера
    xor     r15d, r15d

.main_loop:
    movzx   rax, byte [r12 + r14]
    test    rax, rax
    je      .done

    cmp     byte [r12 + r14], '%'
    je      .spec_handler

    movzx   rax, byte [r12 + r14]
    mov     byte [r13 + r15], al
    inc     r14
    inc     r15

.check_buffer:
    cmp     r15, BUFFER_SIZE
    jb      .main_loop

    mov     rdi, r13
    mov     rsi, r15
    call    print_buffer
    xor     r15d, r15d

    jmp     .main_loop

.done:
; Необходимо очистить буфер от оставшихся символов
    call    .flush_buffer

; Очищаем место, занятое локальными переменными
    add     rsp, 16
; --- Start Epilogue --- 
    pop     r15
    pop     r14
    pop     r13
    pop     r12
    pop     r11
    pop     rbx

    pop     rbp
; --- End Epilogue --- 
    ret


; .............................................................................
; Logic Block .spec_handler
; .............................................................................
; Описание:
;       Копирует символ в основной буфер
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       Адрес из таблицы прыжков
; .............................................................................
.spec_handler:
; Обработка спецификатора в форматной строке
    inc     r14                      
    movzx   rax, byte [r12 + r14]
    lea     rsi, [rel jump_table]
    jmp     [rsi + (rax - MIN_ASCII_SYMBOL) * 8]
; .............................................................................


; .............................................................................
; Logic Block .char_handler
; .............................................................................
; Описание:
;       Копирует символ в основной буфер
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
;       rsi     - Основание системы счисления
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       jmp .check_buffer
; .............................................................................
.char_handler:
    inc     r14
    call    .get_rxx_data
; В регистре rdi находится символ
    mov     byte [r13 + r15], dil 
    inc     r15
    jmp     .check_buffer
; .............................................................................


; .............................................................................
; Logic Block .string_handler
; .............................................................................
; Описание:
;       Размещает строку в буфере, а при недостатке места печатает ее сразу
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
;       rbx     - Адрес аргумента в стеке
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       jmp .check_buffer
; .............................................................................
.string_handler:
    inc     r14
    call    .get_rxx_data
; В регистре rdi находится адрес строки
; Находим длину строки
    call    string_len      
; Если строка состоит только из ноль-терминатора, то ее печать пропускается
    mov     rcx, rax
    test    rcx, rcx
    je      .main_loop
; Если длина строки больше размера буфера, то она выводится
; в стандартный поток вывода напрямую
    cmp     rcx, BUFFER_SIZE
    jae     .print_direct
; Если в буфере недостаточно места для размещения строки, то он очищается
    add     rcx, r15
    cmp     rcx, BUFFER_SIZE
    jb      .move_to_buffer

    call    .flush_buffer

.move_to_buffer:
    mov     rsi, rdi
    mov     rcx, rax
    call    .copy_to_buffer
    jmp     .check_buffer

.print_direct:
    mov     rsi, rcx
; В регистре rdi находится адрес строки, в rsi - ее длина
    call    print_buffer
    jmp     .check_buffer
; .............................................................................


; .............................................................................
; Logic Block .decimal_base_handler
; .............................................................................
; Описание:
;       Подготавливает число к выводу через itoa_decimal
;       и размещает его в основной буфер
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
;       rsi     - Основание системы счисления
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       jmp .check_buffer
; .............................................................................
.decimal_base_handler:
    inc     r14
    call    .get_rxx_data
; В регистре rdi находится число
    lea     rdx, [rel ascii_buffer]
    xor     ecx, ecx
    call    itoa_decimal

    mov     rdx, rax
    add     rdx, r15
    cmp     rdx, BUFFER_SIZE
    jb      .decimal_base_skip_flush

    call    .flush_buffer

.decimal_base_skip_flush:
    lea     rsi, [rel ascii_buffer]
    mov     rcx, rax

    call    .copy_to_buffer
    jmp     .check_buffer
; .............................................................................


; .............................................................................
; Logic Block .power2_base_handler
; .............................................................................
; Описание:
;       Подготавливает число к выводу через itoa_power2
;       и размещает его в основной буфер
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
;       rsi     - Основание системы счисления
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       jmp .check_buffer
; .............................................................................
.power2_base_handler:
    inc     r14
    call    .get_rxx_data
; В регистре rdi находится число
    lea     rdx, [rel ascii_buffer]
    xor     ecx, ecx
    call    itoa_power2

    mov     rdx, rax
    add     rdx, r15
    cmp     rdx, BUFFER_SIZE
    jb      .power2_base_skip_flush

    call    .flush_buffer

.power2_base_skip_flush:
    lea     rsi, [rel ascii_buffer]
    mov     rcx, rax

    call    .copy_to_buffer
    jmp     .check_buffer
; .............................................................................


; .............................................................................
; Logic Block .float_handler
; .............................................................................
; Описание:
;       Подгатавливает число с плавающей точкой к выводу и копирует в буфер
; Начальное состояние:
;       r12+r14 - Текущая позиция в форматной строке 
;       rbx     - Адрес аргумента в стеке
; Портящиеся регистры:
;       caller-saved регистры
; Следующий шаг:
;       jmp .check_buffer
; .............................................................................
.float_handler:
    inc     r14
    call    .get_xmm_data
; В регистре rdi находится число с плавающей точкой
    lea     rsi, [rel ascii_buffer]
    xor     edx, edx
    call    ftoa

    lea     rsi, [rel ascii_buffer]
    mov     rcx, rax
    call    .copy_to_buffer

    jmp     .check_buffer    
; .............................................................................


; -----------------------------------------------------------------------------
; Local Procedure: .get_rxx_data
; -----------------------------------------------------------------------------
; Описание:
;       Возвращает целочисленный аргумент
; Используемые данные:
;       rxx_counter - Номер текущего целочисленного аргумента
;       rbx         - Указатель на область смешанных аргументов
; Выходные параметры:
;       rdi         - Полученный целочисленный аргумент
; Портящиеся регистры:
;       rax
; -----------------------------------------------------------------------------
.get_rxx_data:
    mov     rax, qword rxx_counter
    cmp     rax, GRP_REG_COUNT
    jae     .alternative_int_data_take

    mov     rdi, [rbp + RSI_OFFSET + 8 * rax]
    inc     qword rxx_counter
    jmp     .exit_get_rxx_data

.alternative_int_data_take:
    mov     rdi, [rbx]
    add     rbx, 8
    jmp     .exit_get_rxx_data

.exit_get_rxx_data:
    ret
; -----------------------------------------------------------------------------


; -----------------------------------------------------------------------------
; Local Procedure: .get_xmm_data
; -----------------------------------------------------------------------------
; Описание:
;       Возвращает аргумент вещественного типа данных
;       (В целочисленном регистре)
; Используемые данные:
;       xmm_counter - Номер текущего вещественного аргумента
;       rbx         - Указатель на область смешанных аргументов
; Выходные параметры:
;       rdi         - Полученный вещественный аргумент
; Портящиеся регистры:
;       rax
; -----------------------------------------------------------------------------
.get_xmm_data:
    mov     rax, qword xmm_counter
    cmp     rax, XMM_REG_COUNT
    jae     .alternative_float_data_take

    mov     rdi, [rbp + XMM_ARG_START + 8 * rax]
    inc     qword xmm_counter
    jmp     .exit_get_xmm_data

.alternative_float_data_take:
    mov     rdi, [rbx]
    add     rbx, 8
    jmp     .exit_get_xmm_data

.exit_get_xmm_data:
    ret
; -----------------------------------------------------------------------------


; -----------------------------------------------------------------------------
; Local Procedure: .copy_to_buffer
; -----------------------------------------------------------------------------
; Описание:
;       Копирует данные в буфер
; Входные параметры:
;       rsi - Адрес источника
;       rcx - Сколько байт копировать
; Используемые данные:
;       r13 - Адрес буфера
;       r15 - Текущее смещение
; Портящиеся регистры:
;       caller-saved регистры
;       r15 - Изменение размера буфера
; -----------------------------------------------------------------------------
.copy_to_buffer:
    test    rcx, rcx    
    je      .copy_done

.copy_loop:
    cmp     r15, BUFFER_SIZE
    jb      .do_copy

    push    rcx
    call    .flush_buffer
    pop     rcx

.do_copy:
    movzx   rdx, byte [rsi]
    mov     byte [r13 + r15], dl
    inc     rsi
    inc     r15
    loop    .copy_loop

.copy_done:
    ret
; -----------------------------------------------------------------------------


; -----------------------------------------------------------------------------
; Local Procedure: .flush_buffer
; -----------------------------------------------------------------------------
; Описание:
;       Выводит содержимое буфера в стандартный поток вывода
; Входные параметры:
;       Нет
; Используемые данные:
;       r13 - Адрес буфера
;       r15 - Текущее смещение
; Портящиеся регистры:
;       caller-saved региcтры
;       r15 - Обнуление размера буфера
; -----------------------------------------------------------------------------
.flush_buffer:
    push    rdi
    push    rsi

    mov     rdi, r13
    mov     rsi, r15
    call    print_buffer
    xor     r15d, r15d

    pop     rsi
    pop     rdi

    ret
; -----------------------------------------------------------------------------


.case_percent:
    inc     r14
    mov     byte [r13 + r15], '%'
    inc     r15
    jmp     .check_buffer

.case_b:
    mov     rsi, BIN_BASE
    jmp     .power2_base_handler

.case_c:
    jmp     .char_handler

.case_d:
    mov     rsi, DECIMAL_BASE
    jmp     .decimal_base_handler

.case_f:
    jmp     .float_handler

.case_o:
    mov     rsi, OCT_BASE
    jmp     .power2_base_handler

.case_s:
    jmp     .string_handler

.case_x:
    mov     rsi, HEX_BASE
    jmp     .power2_base_handler

.case_default:
; Случай является заглушкой, и прыжок на него никогда не ожидается
; при корректном использовании спецификаторов
    nop
; =============================================================================


; =============================================================================
; Procedure: print_buffer
; =============================================================================
; Описание:
;       Выводит содержимое буфера в стандартный поток вывода
; Входные параметры:
;       rdi - Указатель на буфер
;       rsi - Количество элементов в буфере
; Выходные параметры:
;       Нет
; Портящиеся регистры:
;       callee-caller
; =============================================================================
print_buffer:
    mov     rax, 1
    mov     rdx, rsi
    mov     rsi, rdi
    mov     rdi, STDOUT_FD
    syscall

    ret
; =============================================================================


; =============================================================================
; Procedure: string_len
; =============================================================================
; Описание:
;       Находит длину строки, оканчивающейся ноль-терминатором
; Входные параметры:
;       rdi - Указатель на строку
; Выходные параметры:
;       rax - Длина строки
; Портящиеся регистры:
;       caller-saved регистры
; =============================================================================
string_len:
    xor     ecx, ecx
.counting_loop:
    movzx   rax, byte [rdi + rcx]
    test    rax, rax
    je      .exit

    inc     rcx
    jmp     .counting_loop

.exit:
    mov     rax, rcx
    ret
; =============================================================================


; =============================================================================
; Procedure: itoa_power2
; =============================================================================
; Описание:
;       Осуществляет запись числа в буфер в системе счисления со степенью двойки
; Входные параметры:
;       rdi - Число
;       rsi - Основание системы счисления (2, 8, 16)
;       rdx - Указатель на буфер
;       rcx - Количество элементов в буфере
; Выходные параметры:
;       rax - Итоговое количество элементов в буфере
; Портящиеся регистры:
;       callee-caller
; =============================================================================
itoa_power2:
; --- Start Prologue ---
    push    rbp
    mov     rbp, rsp

    push    rbx
    push    r12
    push    r13
    push    r14
    push    r15
; --- End Prologue ---

; В регистре r13 хранится указатель на буфер
    mov     r13, rdx   
; В регистре r14 хранится количество элементов в буфере
    mov     r14, rcx
; В регистре r15 хранится число 
    mov     r15, rdi
; В регистре r8 будет храниться шаг для битового сдвига. Инструкция 
; bsr найдет индекс наибольшего единичного бита в rsi
    bsr     r8, rsi
    xor     edx, edx
    mov     rax, NUMBER_OF_BITS
; В регистре rax хранится количество разрядов числа в заданной 
; системе счисления. Делимое будет лежать в rdx:rax, делитель в r8.
; rax = 32 / r8
; rdx = 32 % r8
    div     r8

    test    rdx, rdx
    je      .skip_inc
; Если после нахождение шага битового сдвига число 64 поделилось не нацело,
; то в таком случае надо учесть неполный разряд, который остался.
    inc     rax

.skip_inc:
    mov     rbx, rax

    mov     r9, rsi
; r9 = base - 1 - битовая маска
    dec     r9                          

    mov     rcx, r8
    mov     rax, rbx
.loop_1:
    mov     rsi, r15
    and     rsi, r9
    push    rsi
    shr     r15, cl

    dec     rax
    jne     .loop_1

    mov     rcx, rbx
    xor     r12d, r12d
.loop_2:
    pop     rsi

    test    rsi, rsi
    jne     .is_significant

    test    r12, r12
    je      .condition_2

.is_significant:
    lea     rax, [rel digits]
    movzx   rsi, byte [rax + rsi]
    mov     byte [r13 + r14], sil
    inc     r14
; Если значение r12 ненулевое, значит встречались значащие цифры
    inc     r12

.condition_2:
    loop    .loop_2

    test    r14, r14
    jne     .exit

    mov     byte [r13 + r14], '0'
    mov     r14, 1

.exit:
    mov     rax, r14
; --- Start Epilogue ---
    pop     r15
    pop     r14
    pop     r13
    pop     r12
    pop     rbx

    pop     rbp
; --- End Epilogue ---
    ret 
; =============================================================================


; =============================================================================
; Procedure: itoa_decimal
; =============================================================================
; Описание:
;       Осуществляет запись числа в буфер в десятичной системе счисления
; Входные параметры:
;       rdi - Число
;       rsi - Основание системы счисления (10)
;       rdx - Указатель на буфер
;       rcx - Количество элементов в буфере
; Выходные параметры:
;       rax - Итоговое количество элементов в буфере
; Портящиеся регистры:
;       caller-saved регистры
; =============================================================================
itoa_decimal:
; --- Start Prologue ---
    push    rbp
    mov     rbp, rsp

    push    r13
    push    r14
; --- End Prologue ---

; В регистре r13 хранится указатель на буфер
    mov     r13, rdx   
; В регистре r14 хранится количество элементов в буфере
    mov     r14, rcx

    mov     eax, edi
    test    eax, eax
    jge     .skip_sign_case

    mov     byte [r13 + r14], '-'
    inc     r14
    neg     eax

.skip_sign_case:
    xor     ecx, ecx
    mov     esi, DECIMAL_BASE
.loop_1:
    xor     edx, edx
    div     rsi

    push    rdx
    inc     rcx

    test    eax, eax
    jne     .loop_1

.loop_2:
    pop     rax
    lea     r8, [rel digits]
    movzx   rdx, byte [r8 + rax]
    mov     byte [r13 + r14], dl
    inc     r14
    loop    .loop_2

    mov     rax, r14
; --- Start Epilogue ---
    pop     r14
    pop     r13

    pop     rbp
; --- End Epilogue ---
    ret 
; =============================================================================


; =============================================================================
; Procedure: ftoa
; =============================================================================
; Описание:
;       Осуществляет запись числа с плавающей точкой в буфер
; Входные параметры:
;       rdi - Число с плавающей точкой
;       rsi - Указатель на буфер
;       rdx - Количество элементов в буфере
; Выходные параметры:
;       rax - Итоговое количество элементов в буфере
; Портящиеся регистры:
;       caller-saved регистры
; =============================================================================
ftoa:
; --- Start Prologue ---
    push    rbp
    mov     rbp, rsp

    push    rbx
    push    r13
    push    r14
    push    r15
; --- End Prologue --- 

; В регистре rbx хранится точность вывода числа
; Под точностью подразумевается количество выводимых цифр после запятой
    mov     rbx, DEFAULT_PRECISION
; В регистре r13 хранится указатель на буфер
    mov     r13, rsi
; В регистре r14 хранится количество элементов в буфере
    mov     r14, rdx
; В регистре r15 хранится число
    mov     r15, rdi

    mov     rcx, DOUBLE_SIGN_MASK
    and     rdi, rcx
    test    rdi, rdi
    je      .skip_sign_printing

    mov     byte [r13 + r14], '-'
    inc     r14

.skip_sign_printing:
; Извлекаем экспоненту
    mov     rdi, r15
    mov     rcx, DOUBLE_EXP_MASK
    and     rdi, rcx
    shr     rdi, DOUBLE_EXP_SHIFT

; Проверяем исключения (inf/NaN)
    cmp     rdi, 0x7FF
    je      .handle_exceptions

; Сдвигаем степень двойки
    sub     rdi, DOUBLE_EXP_BIAS

; Извлекаем мантиссу
    mov     rsi, r15
    mov     rcx, DOUBLE_MANT_MASK
    and     rsi, rcx
; Добавляем ведущую единицу к мантиссе
    mov     rcx, DOUBLE_MANT_IMAGINARY_1_MASK
    or      rsi, rcx

    cmp     rdi, -1023
    jne     .skip_denormalized_case
; Добавляем единицу для экспоненты денормализованного числа
; Экспонента денормализованного числа равна -1022
    inc     rdi
; Обнуляем ведущую единицу у денормализованного числа
    mov     rcx, DOUBLE_MANT_IMAGINARY_1_MASK
    xor     rsi, rcx

.skip_denormalized_case:
; Выравниваем мантиссу по левому краю 
    shl     rsi, 11

; Храним в регистре rdx сдвиг (63 - exp)
    mov     rdx, 63
    sub     rdx, rdi

; Если экспонента слишком большая, то обрабатываем число в научной записи
    ; cmp     rdi, 31
; Если экспонента слишком маленькая, то обрабатываем число в научной записи
    ; cmp     rdi, -14

; Если экспонента меньше нуля, то число < 1, а значит нет необходимости
; обрабатывать его целую часть
    test    rdi, rdi
    jl      .number_handler_small

    jmp     .number_handler_default


.done:
    mov     rax, r14
; --- Start Epilogue ---
    pop    r15
    pop    r14
    pop    r13
    pop    rbx

    pop     rbp
; --- End Epilogue ---
    ret


; .............................................................................
; Logic Block .number_handler_small
; .............................................................................
; Описание:
;       Размещает в буфере малое число с показателем меньше нуля
; Начальное состояние:
;       r13+r14 - Текущая позиция в форматной строке 
;       rdi     - Степень числа
; Портящиеся регистры:
;       rcx, rsi, rdi
; Следующий шаг:
;       jmp .fraction_handler
; .............................................................................
.number_handler_small:
; Если -5 < exp < 0, то дробная часть = rsi >> (-exp - 1), но а целая часть уже = 0,
; поэтому ставим ноль и точку в числе
    mov     byte [r13 + r14], '0'
    inc     r14
    mov     byte [r13 + r14], '.'
    inc     r14

    neg     rdi
    dec     rdi
    mov     rcx, rdi
; В регистре rsi будет хранится дробная часть числа
    shr     rsi, cl
    mov     rdi, rbx
    call     .fraction_handler

    jmp     .done
; .............................................................................


; .............................................................................
; Logic Block .number_handler_default
; .............................................................................
; Описание:
;       Размещает в буфере малое число с неотрицательным показателем
; Начальное состояние:
;       r13+r14 - Текущая позиция в форматной строке 
;       rdi     - Степень числа
; Портящиеся регистры:
;       caller-saved
; Следующий шаг:
;       jmp .fraction_handler
; .............................................................................
.number_handler_default:
; Сохраняем экспоненту и мантиссу
    push    rdi
    push    rsi

; В регистре rcx будет находиться сдвиг (63 - exp)
; Так как 0 <= exp < 60, то (63 - exp) > 0
; В регистре rdi будет находиться целая часть числа
    mov     rcx, 63
    sub     rcx, rdi
    mov     rdi, rsi
    shr     rdi, cl

; Кладем в буфер целую часть числа
    mov     rsi, DECIMAL_BASE
    mov     rdx, r13
    mov     rcx, r14
    call    itoa_decimal
    mov     r14, rax

; Возвращаем мантиссу и экспоненту
    pop     rsi
    pop     rdi

; Ставим точку в числе
    mov     byte [r13 + r14], '.'
    inc     r14

; В регистре rcx будет находиться сдвиг (exp + 1)
    mov     rcx, rdi
    inc     rcx
; В регистре rsi будет находиться дробная часть числа
    shl     rsi, cl
    mov     rdi, rbx
    call    .fraction_handler

    jmp     .done
; .............................................................................


; -----------------------------------------------------------------------------
; Local Procedure: .fraction_handler
; -----------------------------------------------------------------------------
; Описание:
;       Размещает в буфере первые n разрядов числа после запятой
; Входные параметры:
;       rsi - Cодержит мантиссу числа, выровненную по левой границе
;       rdi - Число n разрядов для размещенияk
; Используемые данные:
;       r13 - Адрес буфера
;       r14 - Текущее смещение
; Портящиеся регистры:
;       rax, rcx, rdx, rsi, rdi
; -----------------------------------------------------------------------------
.fraction_handler:
    xor     edx, edx
    mov     rax, rsi
    mov     rcx, DECIMAL_BASE
    mul     rcx

    lea     rcx, [rel digits]
    movzx   rcx, byte [rcx + rdx]
    mov     byte [r13 + r14], cl
    inc     r14

    mov     rsi, rax
    dec     rdi
    jne     .fraction_handler

    ret
; -----------------------------------------------------------------------------


; -----------------------------------------------------------------------------
; Local Procedure: .copy_to_buffer
; -----------------------------------------------------------------------------
; Описание:
;       Копирует данные в буфер
; Входные параметры:
;       rsi - Адрес источника
;       rcx - Сколько байт копировать
; Используемые данные:
;       r13 - Адрес буфера
;       r14 - Текущее смещение
; Портящиеся регистры:
;       rcx, rdx, rsi
; -----------------------------------------------------------------------------
.copy_to_buffer:
    test    rcx, rcx    
    je      .copy_done

.do_copy:
    movzx   rdx, byte [rsi]
    mov     byte [r13 + r14], dl
    inc     rsi
    inc     r14
    loop    .do_copy

.copy_done:
    ret
; -----------------------------------------------------------------------------


.handle_exceptions:
    mov     rdi, r15
    mov     rcx, DOUBLE_MANT_MASK
    and     rdi, rcx
    test    rdi, rdi
    je      .handle_inf
    jmp     .handle_nan


.handle_inf:
    lea     rsi, [rel inf_string]
    mov     rcx, inf_string_len
    call    .copy_to_buffer
    jmp     .done


.handle_nan:
    lea     rsi, [rel nan_string]
    mov     rcx, nan_string_len
    call    .copy_to_buffer
    jmp     .done
; =============================================================================


; =============================================================================
; node.GNU-stack SECTION
; =============================================================================
section .note.GNU-stack